InformationRegisters/ВходящиеКонтакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВходящиеКонтакты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатусыЛида</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВходящийКонтакт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_ВходящийКонтакт</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВходящиеКонтакты/Forms/ФормаСпискаРасшифровка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ПравоеЗначение = Параметры.ДатаНачала;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ПравоеЗначение = Параметры.ДатаОкончания;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	Если Параметры.ИспользоватьВидКонтакта Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКонтакта");
		ЭлементОтбора.ПравоеЗначение = ?(ЗначениеЗаполнено(Параметры.ВидКонтакта), Параметры.ВидКонтакта, Справочники.ВидыКонтактов.ПустаяСсылка());
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
		ЭлементОтбора.ПравоеЗначение = Параметры.Сотрудник;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	Если Параметры.ОтборРекламныйИсточник Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РекламныйИсточник");
		ЭлементОтбора.ПравоеЗначение = Параметры.РекламныйИсточник;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;

	Если Параметры.СтолбецЗамеры Тогда
		// выбираем все лиды и вход.контакты, по которым был выполнен замер
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛидЗамеры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лид.Замеры КАК ЛидЗамеры
		|ГДЕ
		|	ЛидЗамеры.ЗамерВыполнен = ИСТИНА
		|	И ЛидЗамеры.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВходящиеКонтакты.Регистратор.Ссылка
		|ИЗ
		|	РегистрСведений.ВходящиеКонтакты КАК ВходящиеКонтакты
		|ГДЕ
		|	ВходящиеКонтакты.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыКонтактов.Замер)
		|	И ВходящиеКонтакты.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
		Запрос.УстановитьПараметр("ДатаНачала", Параметры.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Параметры.ДатаОкончания);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		// делаем отбор
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор");
		ЭлементОтбора.ПравоеЗначение = РезультатЗапроса;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	

КонецПроцедуры
